/*Распарсить JSON
Внутри класса Answer напишите метод answer, который распарсит json и, 
используя StringBuilder, создаст строки вида:
Студент [фамилия] получил [оценка] по предмету [предмет].
На вход метода answer подаются аргументы:
String JSON
String ELEMENT1
String ELEMENT2
String ELEMENT3
Пример:
JSON = "[{\"фамилия\":\"Иванов\",\"оценка\":\"5\",\"предмет\":\"Математика\"}," +
    "{\"фамилия\":\"Петрова\",\"оценка\":\"4\",\"предмет\":\"Информатика\"}," +
    "{\"фамилия\":\"Краснов\",\"оценка\":\"5\",\"предмет\":\"Физика\"}]";
ELEMENT1 = "Студент ";
ELEMENT2 = " получил ";
ELEMENT3 = " по предмету ";
// Студент Иванов получил 5 по предмету Математика
// Студент Петрова получил 4 по предмету Информатика
// Студент Краснов получил 5 по предмету Физика */
// public class Task_3 {
//     class Answer {
//         public static void answer(String JSON, String ELEMENT1, String ELEMENT2, String ELEMENT3) {
//             // Напишите свое решение ниже
    
//         }
//     }
    
// }
